import 끝내기1 from '../../images/끝내기1.png';
import 끝내기2 from '../../images/끝내기2.png';
import 끝내기3 from '../../images/끝내기3.png';
import 끝내기4 from '../../images/끝내기4.png';
import 끝내기5 from '../../images/끝내기5.png';
import 끝내기6 from '../../images/끝내기6.png';
import 끝내기7 from '../../images/끝내기7.png';
import 끝내기8 from '../../images/끝내기8.png';
import 끝내기9 from '../../images/끝내기9.png';
import 끝내기10 from '../../images/끝내기10.png';
import 끝내기11 from '../../images/끝내기11.png';
import 끝내기12 from '../../images/끝내기12.png';
import 끝내기13 from '../../images/끝내기13.png';
import 끝내기14 from '../../images/끝내기14.png';
import 끝내기15 from '../../images/끝내기15.png';
import 끝내기16 from '../../images/끝내기16.png';
import 끝내기17 from '../../images/끝내기17.png';
import 끝내기18 from '../../images/끝내기18.png';
import 끝내기19 from '../../images/끝내기19.png';
import 끝내기20 from '../../images/끝내기20.png';
import 끝내기21 from '../../images/끝내기21.png';
import 끝내기22 from '../../images/끝내기22.png';
import 끝내기23 from '../../images/끝내기23.png';
import 끝내기24 from '../../images/끝내기24.png';
import 끝내기25 from '../../images/끝내기25.png';
import 끝내기26 from '../../images/끝내기26.png';
import 끝내기27 from '../../images/끝내기27.png';
import 끝내기28 from '../../images/끝내기28.png';
import 끝내기29 from '../../images/끝내기29.png';
import 끝내기30 from '../../images/끝내기30.png';
import 끝내기31 from '../../images/끝내기31.png';
import 끝내기32 from '../../images/끝내기32.png';
import 끝내기33 from '../../images/끝내기33.png';
import 끝내기34 from '../../images/끝내기34.png';
import 끝내기35 from '../../images/끝내기35.png';
import 끝내기36 from '../../images/끝내기36.png';
import 끝내기37 from '../../images/끝내기37.png';
import 끝내기38 from '../../images/끝내기38.png';
import 끝내기39 from '../../images/끝내기39.png';
import 끝내기40 from '../../images/끝내기40.png';
import 끝내기41 from '../../images/끝내기41.png';
import 끝내기42 from '../../images/끝내기42.png';
import 끝내기43 from '../../images/끝내기43.png';
import 끝내기44 from '../../images/끝내기44.png';
import 끝내기45 from '../../images/끝내기45.png';
import 끝내기46 from '../../images/끝내기46.png';
import 끝내기471 from '../../images/끝내기47-1.png';
import 끝내기472 from '../../images/끝내기47-2.png';
import 끝내기48 from '../../images/끝내기48.png';
import 끝내기49 from '../../images/끝내기49.png';
import 끝내기50 from '../../images/끝내기50.png';

export const 끝내기Steps = [
  {
    id: 1,
    title: "끝내기의 의미",
    text: "종반 단계에서 서로의 영토를 확정짓는 작업을 말합니다. 끝내기 단계에서는 상대방의 돌을 잡는 등의 싸움보다는 내 집을 최대한 늘리고 상대의 집은 최대한 줄이는 것을 목표로 삼습니다. 가장 기본적인 방법으로는 '찌르기'가 있습니다.",
    image: 끝내기1,
  },
  {
    id: 2,
    title: "공배의 의미",
    text: "'공배'란 흑과 백 누가 두어도 집이 안되는 곳을 말합니다. 흑집과 백집의 경계선에 위치한 비어있는 공간으로, 집의 가치가 없기 때문에 대국의 마지막 단계에서 두는 것이 좋습니다. 공배를 다 메우면 종국입니다.",
    image: 끝내기2,
  },
  {
    id: 3,
    title: "종국의 이해",
    text: "종국이 되는 시점은 '둘 필요가 있는 곳이 없을 때'입니다. 종국 시점을 판단하지 못하면 자신의 집을 줄이거나, 상대방의 집 안으로 무리하게 침입해서 손해를 보는 경우가 많습니다.",
    image: 끝내기3,
  },
  {
    id: 4,
    title: "계가와 덤",
    text: "대국이 끝나는 방식은 두 가지가 있습니다. 하나는 대국 중간에 한 쪽이 기권을 하는 '불계'이고, 또 하나는 끝까지 두어 흑백의 집 수를 확인하는 '계가'입니다. '덤'은 서로가 맞수라고 생각하여 호선 바둑을 둘 때, 백에게 추가로 주는 집을 말합니다. 한국에서는 보통 6.5집의 덤을 백에게 주고 있습니다.\n계가를 하는 단계는 크게 4가지로 나눌 수 있습니다.\n-1단계 : 사석 들어내기\n-2단계 : 사석 메우기\n-3단계 : 돌을 이동시켜서 집 정리하기\n-4단계 : 집 수를 세어 승패 확인하기",
    image: 끝내기4,
  },
  {
    id: 5,
    title: "따내기의 크기",
    text: "끝내기에서 기본적인 따내는 끝내기의 가치는 <돌 개수 x 2>입니다.",
    image: 끝내기5,
  },
  {
    id: 6,
    title: "반패의 크기",
    text: "반패라 불리는 패 모양이 있습니다. 이 패 모양의 크기는 1집이 되지 않으므로 1집짜리 끝내기보다는 나중에 하는 것이, 공배보다는 먼저 하는것이 올바른 순서입니다.",
    image: 끝내기6,
  },
  {
    id: 7,
    title: "1선 젖히기",
    text: "1선에서 집의 경계선을 마무리 짓기 위해서는 1선 젖히기가 많이 사용됩니다. 상대방이 1선을 젖혔을 때는 보통 그 부분에 응수를 하는 것이 좋습니다. 응수하지 않으면 내 집이 계속해서 줄어들기 때문입니다.",
    image: 끝내기7,
  },
  {
    id: 8,
    title: "1선 연결하기 및 끊기",
    text: "대각선 모양은 약점이 있는 경우가 상당히 많기 때문에 조심해야 합니다. 만약 상대가 대각선의 약점을 지키지 않는 경우 내가 먼저 약점을 찾으면 상대의 연결을 쉽게 끊을 수 있습니다.",
    image: 끝내기8,
  },
  {
    id: 9,
    title: "2선 젖히기",
    text: "2선 젖히는 끝내기는 실전에서 매우 자주 나오는 끝내기로, 활용도가 높습니다. 상대가 2선 젖혔을 때는 보통 막아서 수비를 하면 됩니다.",
    image: 끝내기9,
  },
  {
    id: 10,
    title: "2선 연결하기 및 끊기",
    text: "1선과 마찬가지로 2선도 대각선 모양에 약점이 있는 경우가 많습니다. 2선 대각선의 약점을 찾아 연결을 끊으면 돌을 잡을 수 있을 때가 많습니다.",
    image: 끝내기10,
  },
  {
    id: 11,
    title: "2선 입구자",
    text: "2선 입구자 끝내기를 할 줄 알게 되면 집을 더 쉽게 늘릴 수 있습니다. 상대가 내 집으로 침투하는 것이 싫으면 막아서 수비하면 됩니다.",
    image: 끝내기11,
  },
  {
    id: 12,
    title: "2선 한 칸 뛰기",
    text: "2선에서 상대의 집을 줄일 때는 2선 한 칸 뛰는 수가 많이 사용됩니다.",
    image: 끝내기12,
  },
  {
    id: 13,
    title: "집 정리하기",
    text: "계가를 할 때 집 정리를 하는데 이 때 알아두면 좋은 집 모양들이 있습니다.",
    image: 끝내기13,
  },
  {
    id: 14,
    title: "옥집 끝내기 크기",
    text: "옥집이 될 수 있는 곳을 집으로 만드는 끝내기는 대부분의 경우 1집의 가치를 가집니다. 따라서 끝내기의 거의 마지막 단계에서 하는 경우가 많습니다.",
    image: 끝내기14,
  },
  {
    id: 15,
    title: "공배 조심하기",
    text: "공배를 메우다 자충이 되어 수가 나는 경우가 자주 발생하기 때문에 대국이 끝날 때까지 방심하지 말고 조심해야합니다.",
    image: 끝내기15,
  },
  {
    id: 16,
    title: "후수 끝내기",
    text: "끝내기의 종류는 크게 선수 끝내기와 후수 끝내기로 나눌 수 있습니다. 후수란 어떠한 수를 두었을 때, 상대방이 그 방면에 둘 필요가 없는 수를 말합니다. 즉 후수는 상대방이 다른 곳을 두어도 다음에 집으로 큰 이득을 볼 수 없는 수를 일컫는 것입니다.",
    image: 끝내기16,
  },
  {
    id: 17,
    title: "선수 끝내기",
    text: "선수 끝내기는 어떠한 수를 두었을 때, 상대방이 그 방면에 둘 필요가 있는 수를 말합니다. 즉 선수는 상대방이 다른 곳을 두어도 다음에 집으로 큰 이득을 볼 수 있는 수를 일컫는 것입니다.\n\n선수 끝내기는 다시 양선수 끝내기와 한 쪽 선수 끝내기로 나뉩니다. 한 쪽 선수 끝내기는 말 그대로 한 쪽만 선수이고 다른쪽은 후수가 되는 끝내기를 말합니다.",
    image: 끝내기17,
  },
  {
    id: 18,
    title: "선수와 후수 순서",
    text: "선수 후수 끝내기의 판단이 끝났으면, 우선 선수 끝내기를 해야합니다.",
    image: 끝내기18,
  },
  {
    id: 19,
    title: "집 안의 약점",
    text: "끝내기를 하는 과정에서 생기는 약점을 조심하세요!",
    image: 끝내기19,
  },
  {
    id: 20,
    title: "양선수 끝내기",
    text: "양선수 끝내기는 말 그대로 양쪽이 모두 선수인 끝내기를 뜻합니다. 양선수 끝내기는 흑이 두나 백이 두나 선수이기 때문에 가장 가치가 큰 끝내기입니다. 흔히 한 쪽 선수 끝내기는 후수 끝내기의 2배, 양선수 끝내기는 4배의 가치가 있다고 말합니다. 예를 들어 1집 끝내기가 한 쪽 선수라면 2집, 양선수 끝내기라면 4집의 가치가 있다고 판단하는 것입니다.",
    image: 끝내기20,
  },
  {
    id: 21,
    title: "양선수, 한 쪽 선수, 후수 끝내기",
    text: "올바른 끝내기 순서는 양선수->한 쪽 선수->후수 순서입니다.",
    image: 끝내기21,
  },
  {
    id: 22,
    title: "먹여치기",
    text: "먹여치면 활로를 하나 줄이는 효과가 있기 때문에, 자충을 유도하거나 촉촉수 형태를 만들 수 있을 때 먹여치면 상대의 집을 줄일 수 있습니다.",
    image: 끝내기22,
  },
  {
    id: 23,
    title: "건너 붙여서 잡기",
    text: "경우에 따라 건너 붙여서 상대방의 돌을 잡을 수 있습니다.",
    image: 끝내기23,
  },
  {
    id: 24,
    title: "2선 날일자",
    text: "2선 날일자 끝내기는 보통 3선에서 두 칸 간격으로 대치했을 때 사용합니다.",
    image: 끝내기24,
  },
  {
    id: 25,
    title: "안형과 연결된 끝내기",
    text: "안형과 연결된 끝내기는 모든 끝내기 중 가장 급선무라고 할 수 있습니다.",
    image: 끝내기25,
  },
  {
  id: 26,
  title: "귀, 변, 중앙",
  text: "끝내기가 귀, 변, 중앙에 남아 있고 모두 후수 끝내기라면 대부분의 경우 귀->변->중앙 순으로 끝내기를 하는 것이 좋습니다. 다만 집의 가치를 판단하고 순서를 바꾸는 경우도 많습니다.",
  image: 끝내기26,
},
{
  id: 27,
  title: "맞보기",
  text: "양쪽에 선택지가 있는 맞보기의 원리를 사용하여 끝내기를 할 수도 있습니다.",
  image: 끝내기27,
},
{
  id: 28,
  title: "찝기",
  text: "찝는 맥을 주로 연결을 끊을 때 사용하지만 끝내기 단계에서도 찝으면 집으로 이득일 때가 있습니다.",
  image: 끝내기28,
},
{
  id: 29,
  title: "2선 배붙이기",
  text: "2선에 빠진 돌이 있을 때 배붙임을 할 수 있는 경우가 있습니다. 배붙임을 하면 상대의 집을 더 많이 줄일 수 있다.",
  image: 끝내기29,
},
{
  id: 30,
  title: "1선 눈목자(비마 달리기)",
  text: "2선에 빠진 돌이 있을 때 상대의 집 안으로 1선 눈목자를 들어가면 상대의 집을 많이 줄일 수 있습니다.",
  image: 끝내기30,
},
{
  id: 31,
  title: "반반 권리 포함 세기",
  text: "끝내기의 권리가 흑백 반반일 경우 다음 끝내기의 크기를 반으로 나눈 값을 포함해서 끝내기의 크기를 세어야 합니다.",
  image: 끝내기31,
},
{
  id: 32,
  title: "양쪽 지키기",
  text: "집을 보강할 때는 효율적으로 지키는 방법을 생각하여야 합니다. 만약 양쪽에 약점이 있다면 한 수로 양쪽을 지키는 방법이 있을지 고려해 보면 좋습니다.",
  image: 끝내기32,
},
{
  id: 33,
  title: "코 붙이기",
  text: "코 붙이는 맥점을 사용하면 상대의 집을 더 많이 줄일 수 있습니다.",
  image: 끝내기33,
},
{
  id: 34,
  title: "끊기",
  text: "끝내기에서 끊는 수를 적절한 순간에 사용하면 이득을 볼 수 있을 때가 있습니다.",
  image: 끝내기34,
},
{
  id: 35,
  title: "껴붙이기",
  text: "껴붙이는 끝내기는 주로 연결할 때 사용하는데 끝내기에서도 껴붙이는 수를 통해 상대방의 집을 많이 줄일 수 있습니다.",
  image: 끝내기35,
},
{
  id: 36,
  title: "반패의 크기",
  text: "흔히 반패라고 불리는 형태가 있습니다. 하지만 엄밀하게 말하면 이 패의 크기는 반집이 아니라 3분의 1집 또는 3분의 2집 입니다.",
  image: 끝내기36,
},
{
  id: 37,
  title: "끼우기",
  text: "끼우는 맥을 잘 활용하면 상대의 돌을 잡거나 상대의 집을 줄일 수 있습니다.",
  image: 끝내기37,
},
{
  id: 38,
  title: "1선 치중하기",
  text: "사활 뿐만 아니라 끝내기에서도 1선 치중을 해서 집으로 이득 볼 수 있습니다.",
  image: 끝내기38,
},
{
  id: 39,
  title: "키워서 버리기",
  text: "끝내기에서도 3선의 돌은 키워서 버리는게 집으로 이득인 경우가 많습니다.",
  image: 끝내기39,
},
{
  id: 40,
  title: "2선 붙이기",
  text: "2선 붙이는 끝내기는 2선에 내 기착점이 있으면 100% 성립합니다. 하지만 내 기착점이 3선에 있으면 주변 배석에 따라 성립 여부가 달라집니다.",
  image: 끝내기40,
},
{
  id: 41,
  title: "1선 배붙이기",
  text: "끝내기에서 배붙임은 2선 뿐만 아니라 1선에서도 활용할 수 있습니다.",
  image: 끝내기41,
},
{
  id: 42,
  title: "1선 입구자",
  text: "1선 입구자 끝내기는 수비 수단, 연결 수단, 수상전 맥, 침투 수단 등 다양하게 활용할 수 있는 끝내기입니다.",
  image: 끝내기42,
},
{
  id: 43,
  title: "역끝내기",
  text: "역끝내기란 어느 한 쪽이 선수 끝내기를 할 수 있는 곳을 역으로 하는 것을 말합니다. 큰 범주 안에서 같은 후수라도 양쪽이 후수인 곳과 한 쪽이 선수인 경우 그 가치가 다릅니다. 후수이긴 하지만 상대가 두면 선수인 곳을 역으로 두는 것이 더 가치가 큰 것입니다.",
  image: 끝내기43,
},
{
  id: 44,
  title: "빅 만들기",
  text: "대부분의 경우 빅이 나는 것을 간과합니다. 빅을 만들어서 상대방의 집을 없애세요!",
  image: 끝내기44,
},
{
  id: 45,
  title: "2선 입구자 끝내기",
  text: "2선 입구자 끝내기를 잘 활용하면 집으로 꽤 많이 이득 볼 수 있습니다.",
  image: 끝내기45,
},
{
  id: 46,
  title: "치중하는 끝내기",
  text: "치중하는 수는 보통 사활에서 많이 쓰이지만 끝내기에서도 잘 활용하면 이득을 볼 수 있습니다. 상대의 모양에 급소가 보일 때 치중하는 수를 고려해봅시다.",
  image: 끝내기46,
},
{
  id: 47,
  title: "눈목자 끝내기 대응 방법",
  text: "상대방이 1선 눈목자를 두었을 때 대응책은 내 돌의 배석에 따라 달라집니다.",
  image: [끝내기471,끝내기472]
},
{
  id: 48,
  title: "패 활용",
  text: "끝내기에서도 패를 활용하면 집으로 이득 볼 수 있는 상황이 많습니다!",
  image: 끝내기48,
},
{
  id: 49,
  title: "1선 날일자",
  text: "1선 눈목자가 성립하지 않는 경우 차선책으로 1선 날일자 끝내기를 생각해봅시다.",
  image: 끝내기49,
},
{
  id: 50,
  title: "날일자 건너 붙이기",
  text: "모양을 정리할 때 날일자 건너 붙이기를 사용해보세요.",
  image: 끝내기50,
},

];
