// src/pages/club/rules.jsx

import React from 'react';
import '../Rule.css';
const ClubRules = () => {
  return (
    <div className="club-rules-container">
      <h1>회칙</h1>
<h3>제1장 총칙</h3>

1조.	본회는 경북대학교 복현기우회라 한다.<br></br><br></br>
2조.	본회는 교내의 바둑동호인들이 교류 및 기리(棋理)연구를 통한 올바른 기도정신의
	이해 및 바둑인 상호간의 유대를 긴밀히 하기위한 활동을 전개함을 그 목적으로
	한다.<br></br><br></br>
3조.	본회는 그 목적 달성을 위하여 다음과 같은 사업을 수행한다.<br></br><br></br>
	-1. 기리(棋理)연구<br></br>
	-2. 교내외의 바둑동호인들의 교류 및 친선도모에 관한 일<br></br>
	-3. 올바른 기도의 이해와 보급을 위한 강좌 및 연구발표회 개최<br></br>
	-4. 기타 본회의 목적 달성에 관한 일<br></br><br></br>
4조.	본회의 모든 기획 및 운영은 학생의 신분에 적합한 것으로써 회원의 창의에 의하여
	일체의 외부로부터의 간섭을 배제하여 독자적으로 운영을 한다.<br></br><br></br>
5조.	본회의 소재는 경북대학교로 한다. 단, 필요시 옮길 수 있다.<br></br><br></br>

<h3>제2장 회원</h3>

6조.	정회원<br></br><br></br>
	-1. 경북대학교에 소속되어 한 학기 이상 활동한 사실이 있고 회장단의 인정이
	있을 시 정회원이 될 수 있다.<br></br>
	-2. 정회원은 본회가 참가 또는 주최하는 교내외의 대회 및 행사에 1회 이상 참여해 활동한 사실이 있어야 한다.<br></br>
	-3. 2항에서 규정된 사항을 만족시키지 못할 경우, 본인이 활동한 기간 중 열린 정기 집회의 4분의 3이상 참석한 경우에 한해, 임원회의에서 의결에 따라 조정할 수 있다.<br></br><br></br>
7조.	준회원<br></br><br></br>
	-1. 본회의 목적에 동의하고 본회의 활동에 참가의사가 있는 자로 회장단의 인정이
	있을 시 준회원이 될 수 있다.<br></br><br></br>
8조.	명예회원<br></br><br></br>
	-1. 명예회원은 본회 정회원으로 대학을 졸업한 자 또는 본회에 공헌이 큰 자로
	한다.<br></br>
	-2. 명예회원으로 구성된 자문위원회를 구성한다.<br></br><br></br>
9조.	회원의 제명<br></br><br></br>
	-1. 회장단에 사전 통보 없이 정기 총회 및 행사에 4회 이상 불참한 자.<br></br>
	-2. 본회에 내외적으로 명예를 훼손시켰다고 인정되는 자.<br></br>
	-3. 기타 회원의 신분에 어긋나는 행동을 한 자.<br></br>
	-4. 1,2,3항 중 한 가지 이상에 해당한다고 판단될 경우 회장은 본회 정회원들의             찬반 투표를 거쳐 제명시킬 수 있다.<br></br><br></br>
10조.	본회의 회원은 활동에 의한 이익을 누릴 권리가 있으며, 그 활동에 협조 할 의무가 	있다.<br></br><br></br>

<h3>제3장	조직</h3>

11조.	본회는 회장 1명, 부회장 1명, 총무 1명을 포함하여 다음과 같은 부서를 둔다.<br></br><br></br>
	-편집부, 기획부(단, 회장의 판단에 따라 단기적인 목적 달성을 위한 부서를 개설할          수 있으며 명칭과 담당하는 업무에 대해 공지해야한다.)<br></br><br></br>
12조.	회장 후보자는 매 학기가 끝나기 전 정회원 1명 이상의 추천과 2명 이상의 동의를          받은 정회원이어야 한다.  <br></br><br></br>
	-회장 선출은 직접 총 선거를 통해 출석 정회원의 3분의2 이상이 출석한 경우 출석 	정회원의 3분의 2 이상 득표한 자로 결정된다. (1차 2/3, 2차 2/3, 3차 1/2)<br></br>
        -단일 후보인 경우에도 이와 동일하다.<br></br>
	-후보자의 사퇴의사가 있을 시 추천인의 동의를 얻어 사퇴여부를 결정한다.<br></br><br></br>
13조.	차기 회장 선출을 위한 총회 공고는 회장이 그 7일 전에 공고하며, 해당 총회에서          선거를 마무리하는 것을 원칙으로 한다. <br></br><br></br>
14조.	보궐선거가 필요할 경우 즉시 전 회원에게 그 사실을 알려야 하며 임시 임원회의를 	거쳐 7일 이내로 보궐선거의 가부 및 일정을 공지해야한다.<br></br><br></br>
15조.	총무와 부회장은 회장이 임명한다. 각 부서의 장은 지원받는 것을 원칙으로 하되,           차기 회장의 임기 시작 1주일 전까지 후보자가 공석일 경우 차기 회장이 임명할           수 있다.<br></br><br></br>
16조.	회장은 정기 집회 및 회장단 회의를 주재하고 본회의 대표로서의 업무를 담당한다.<br></br><br></br>
	-부회장은 회장을 보좌하여 회장이 부재 시 그 직무를 대행하며 본회의 내외 행사와          총회 및 집회 등의 내용을 기록한다.<br></br>
	-총무는 본회의 재정 및 회계를 관리하며 회비 출납 내역을 감독하고 예산 및 결산          서를 작성한다. <br></br>
	-회장단은 회장, 부회장, 총무와 각 부서의 장으로 구성되며 정회원인 자만이 지원할          수 있다. <br></br>
        -각 부서의 부원은 부장의 판단에 따라 필요 시 지원받는 것으로 한다.<br></br>
        -필요에 따라 임시 또는 정기 총회에서 출석 정회원의 3분의 2 이상의 동의를 거친 	후 회장단 및 각 부장들에게 혜택을 줄 수 있다.<br></br><br></br>
17조.	각 부서의 임무는 다음과 같다.<br></br><br></br>
	-1. 편집부<br></br>
	본회의 간행물 출판과 SNS를 통한 대외홍보를 담당한다.<br></br><br></br>
	-2. 기획부<br></br>
	본회가 주체인 행사들의 일정과 실행 방법을 기획, 논의해 회원들에게 공지한다.<br></br><br></br>
18조.	회장단은 다음과 같은 사항을 관찰한다.<br></br><br></br>
	-1. 연 중 행사 계획 수립 및 추진<br></br>
	-2. 예산 및 결산의 인준<br></br>
  -3. 본회의 활동에 필요한 각종 서류 제출 및 행정 절차 담당 <br></br>
	-4. 회칙 개정안의 제출<br></br>
	-5. 본회의 주체 행사 총괄<br></br>
	-6. 자문위원회 연락 및 협조<br></br><br></br>
19조.	본회의 명예회원으로 구성된 자문위원회는 본회의 자문에 응하며, 협조 및 조언을 제공할 수 있다.<br></br><br></br>
20조.	회장과 부회장의 임기는 원칙적으로 이전 학기의 종강일로부터 해당 학기의 종강일 까지로 정한다. 단 현 회장과 차기 회장의 합의에 따라 조정될 수 있으며 이 경우          회원들에게 그 사실을 알려야 한다. <br></br><br></br>

<h3>제4장 회칙</h3>
21조.	본회는 연 4회의 정기총회를 가지며 필요시 임시총회를 가질 수 있다.
	모든 총회는 7일 전까지 회장단의 회의를 거쳐 회장이 공지해야 한다.<br></br><br></br>
	-1. 정기총회<br></br>
	정기총회에서는 차기 회장단 선출, 해당 회계기간의 회계결산 및 승인, 회칙 개정,          그 외 본회의 중요사항들을 결정한다.<br></br><br></br>
	-2. 임시총회<br></br>
	임시총회는 본회에 중대 사항이 생겼을 때 회장이 소집 할 수 있다. 단 회장이 공	석일 경우 부회장이 그 권한을 대신 갖는다.<br></br><br></br>
22조.	본회는 매주 일정한 날에 정기 집회를 가지고 필요시 임원회를 가질 수 있다.<br></br><br></br>

<h3>제5장 재정</h3>

23조.	본회의 재정은 회원의 회비와 기부금 및 대외 활동을 통한 대가를 재정으로 충당한
	다.<br></br><br></br>
24조.	본회의 회계기간은 회장 임기의 시작일과 종료일 사이의 기간으로 한다.<br></br><br></br>
25조.	회장은 매 회계기간 말에 결산 보고서를 총회에 제출하고 그 승인을 받아야한다.<br></br><br></br>
26조.	모든 재정의 중요 지출은 회장의 승인을 받아야하며 지출 항목을 7일 이내로 회원	들에게 후보고해야 한다.<br></br><br></br>

<h3>제6장 회칙 개정</h3>

27조.	회칙의 개정은 회장단과 자문위원회 혹은 정회원 5인의 발의로 제한할 수 있다.<br></br><br></br>
28조.	제안된 회칙의 개정은 정회원의 2/3이상의 출석과 출석 정회원의 2/3이상의 찬성
	에 의해 가결된다.<br></br><br></br>
29조.	개정된 회칙은 공포 즉시 적용된다.<br></br><br></br>
<h3>제7장 상벌</h3>

30조.	본회의 활동에 특별히 공로가 크다고 인정되는 자를 회장이 표창할 수 있다.회원의 	제명은 제 9조의 사항에 의거한다.<br></br><br></br>
31조.	본회의 활동에 지대한 공로가 있는 사회기관 및 개인에 대하여 회장은 감사장 및
	포상을 할 수 있다.<br></br><br></br>
<h3>제8장	부칙</h3>

32조.	본 회칙에 규제되지 않은 사항은 경북대학교 총동아리연합회 회칙에 준한다.<br></br>
    </div>
  );
};

export default ClubRules; // default export 추가
